[
    {
        "id": 1,
        "name": "Goncha",
        "category": "Food and Drinks",
        "discount_description": "Up to 15% off for all drinks",
        "requirements": {
            "r1": "In person only",
            "r2": "Student ID required"
        },
        "locations": "https://www.google.com/maps/search/goncha/@34.7678917,135.4617493,24459m/data=!3m1!1e3?entry=ttu&g_ep=EgoyMDI0MTAxNC4wIKXMDSoASAFQAw%3D%3D",
        "description": "Goncha is a popular bubble tea brand from Taiwan, known for its high-quality, customizable drinks featuring fresh brewed tea and various toppings like tapioca pearls and fruit jellies. It emphasizes freshness and personalization, appealing to both traditional tea lovers and a younger audience.",
        "expiration_date": "None",
        "image": "https://www.gong-cha.com/@resource/images/main/img-values.jpg",
        "tags": {
            "t1": "Drinks"
        }
    },
    {
        "id": 2,
        "name": "JyuJyu Calbi",
        "category": "Food",
        "discount_description": "2500Yen (tax included), Weekday limited student limited all-you-can-eat yakiniku 100 minutes (order stop 80 minutes) + various bars included 2,500 yen including tax",
        "requirements": {
            "r1": "In person only",
            "r2": "※Please present your student ID card. ※Price (course, single item), product content or product composition varies depending on the store. ※Some stores do not implement it. ※It cannot be used in conjunction with other tickets and other discount services."
        },
        "locations": "https://www.google.com/maps/search/じゅうじゅうカルビ+（店舗ごと）/@34.8033693,135.5184456,12.34z?entry=ttu&g_ep=EgoyMDI0MTAxNi4wIKXMDSoASAFQAw%3D%3D",
        "description": "Juju Ribs, a specialty that bears the name of our shop. Please enjoy the popular Rib BIG3!We would like to thoroughly improve both quality and service so that we can make our customers' daily lives special.",
        "expiration_date": "No deadline",
        "image": "https://www.tomato-a.co.jp/jyujyukarubi/assets/images/top/concept_photo03.png",
        "tags": {
            "t1": "Foods"
        }
    },

    {
        "id": 3,
        "name": "Korakuen",
        "category": "Food",
        "discount_description": "Student discount set, Each set is an eat-in limited campaign. ※Order an all-you-can-eat set within the range you can eat. You can order up to 5 desserts.",
        "requirements": {
            "r1": "In person only, Takeout, drive-through, and delivery are not eligible.",
            "r2": "※Please present your student ID card. ※Some menus vary depending on the store. ※Some stores do not sell it. ※Please check the details at the store."
        },
        "locations": "https://www.google.com/maps/search/幸楽苑+（店舗ごと）/@34.8136584,135.4268363,11z/data=!3m1!4b1?entry=ttu&g_ep=EgoyMDI0MTAxNi4wIKXMDSoASAFQAw%3D%3D",
        "description": "JKorakuen is a popular chain of ramen restaurants in Japan known for serving affordable and delicious ramen dishes. The restaurant chain offers a variety of ramen types, including soy sauce (shoyu), miso, and tonkotsu (pork bone broth) ramen.",
        "expiration_date": "No deadline, limited to weekdays.",
        "image": "https://www.kourakuen.co.jp/images/brand/sliders/HP_月見らーめん終了間近.jpg",
        "tags": {
            "t1": "Foods"
        }
    },

      {
    "id": 4,
    "name": "Tully's Coffee Osaka",
    "category": "Drinks",
    "discount_description": "Student exclusive: Enjoy 15% off on any hot or cold drink when you present your student ID. Valid on weekdays only.",
    "requirements": {
        "r1": "Offer valid for in-store purchases only, not applicable for mobile orders.",
        "r2": "Present your student ID at the time of purchase. This offer cannot be combined with other discounts or promotions."
    },
    "locations": "https://www.google.com/maps/search/Tully's+Coffee+Osaka",
    "description": "Tully's Coffee is a popular coffee shop chain known for offering a variety of premium coffee, espresso drinks, teas, and seasonal beverages, served in a cozy and student-friendly environment.",
    "expiration_date": "No expiration date, available only on weekdays.",
    "image": "https://www.nishimura-ns.co.jp/wp/wp-content/themes/nishimura/common/tullys/pic-tullys01s.jpg",
    "tags": {
        "t1": "Drinks"
    }
},

    {
    "id": 5,
    "name": "Shabu-shabu Tajimaya",
    "category": "Food",
    "discount_description": "2750Yen (tax included), [Student discount course] All-you-can-eat beef shabu-shabu or sukiyaki with drink bar (90 minutes) <8 items in total> This course is limited to student groups only.",
    "requirements": {
        "r1": "Offer valid for in-store purchases only.Present your student ID at the time of purchase.",
        "r2": "※The time limit is 90 minutes. ( The last order is 15 minutes before the time.) ※A separate fee may be charged for leftovers that are noticeable. ※Please note that it is not possible to change to a different type of hot pot during the meal."
    },
    "locations": "https://www.google.com/maps/place/Shabu-Shabu+Tajimaya/@34.982789,135.7518471,17z/data=!3m1!4b1!4m6!3m5!1s0x600108abe6f88ae1:0x48dd699f83b1183a!8m2!3d34.982789!4d135.754422!16s%2Fg%2F11b7qqsdzp?entry=ttu&g_ep=EgoyMDI0MTAxNi4wIKXMDSoASAFQAw%3D%3D",
    "description": "Shabu-shabu Tajimaya is a popular chain of Japanese hotpot restaurants that offers a wide range of high-quality meats and vegetables for shabu-shabu, along with a variety of dipping sauces and side dishes.",
    "expiration_date": "No deadline",
    "image": "https://manzo-kyoto.com/shop/tajima/img/room05.jpg",
    "tags": {
        "t1": "Foods",
        
    }
},

    {
    "id": 6,
    "name": "Dondon Udon",
    "category": "Food",
    "discount_description": "350Yen, Student discount udon.This menu is for elementary school, junior high school students, high school students, junior college students, vocational school students, and college students.",
    "requirements": {
        "r1": "You will need to present your student handbook and student ID card. I want students to eat their fill. With that in mind, Dondon has been offering student discount udon since its founding.",
        "r2": "Please check the details of the student discount information when you visit the store.Topping with students' favorite meat, kamaboko, and tempura, it fills your stomach. Learning udon is also recommended in the hot summer. You can enjoy extremely delicious zaru udon made with freshly boiled noodles at a great price. If you are hungry, A and C sets with rosubi. Please enjoy the B set with cooked rice.""
    },
    "locations": "https://www.google.com/maps/place/うどん処+雲母/@34.7988265,135.5743127,17z/data=!3m1!4b1!4m6!3m5!1s0x6000e2f1fef300dd:0x1340b3cc226aa1ca!8m2!3d34.7988265!4d135.5768876!16s%2Fg%2F1tzvwfpg?entry=ttu&g_ep=EgoyMDI0MTAxNi4wIKXMDSoASAFQAw%3D%3D",
    "description": "Dondon Udon is a beloved chain of udon noodle restaurants in Japan, offering a variety of freshly made udon dishes, including tempura udon, kitsune udon, and zaru udon, known for their chewy noodles and flavorful broths.",
    "expiration_date": "No deadline",
    "image": "https://img21.shop-pro.jp/PA01464/038/etc/top_h.jpg?cmsp_timestamp=20210607094623",
    "tags": {
        "t1": "Foods",
        
    }
},

    {
    "id": 7,
    "name": "Café de Crie",
    "category": "Drink",
    "discount_description": "Student beverage discount: Enjoy 15% off any coffee or beverage when you present your student ID at the counter. Valid for in-store purchases only.",
    "requirements": {
        "r1": "Available for in-person orders only; not applicable for online or mobile orders.",
        "r2": "Please present a valid student ID to claim the discount. This offer cannot be combined with other discounts or promotions."
    },
    "locations": "https://www.google.com/maps/search/Café+de+Crie+Osaka",
    "description": "Café de Crie is a popular coffee shop chain offering a wide variety of premium coffee, teas, and light meals, making it an ideal spot for students to study or unwind.",
    "expiration_date": "No expiration date, available on weekdays.",
    "image": "https://c-united.co.jp/crie-maison/img/top/info04.jpg",
    "tags": {
        "t1": "Drinks",
        
    }
},
    {
    "id": 8,
    "name": "Pablo Cheese Tart",
    "category": "Food",
    "discount_description": "Student discount: Get 10% off on any cheese tart or drink when you present your student ID at the counter. This offer is valid for dine-in only.",
    "requirements": {
        "r1": "Offer valid for in-store purchases only; not applicable for delivery or takeout.",
        "r2": "You must show a valid student ID at the time of purchase. This discount cannot be combined with other promotions."
    },
    "locations": "https://www.google.com/maps/search/Pablo+Cheese+Tart+Osaka",
    "description": "Pablo Cheese Tart is a popular dessert chain known for its delicious, freshly baked cheese tarts. They offer a variety of flavors, making it a perfect treat for students after a long day of classes.",
    "expiration_date": "Valid until December 31, 2024, on weekdays only.",
    "image": "https://tb-static.uber.com/prod/image-proc/processed_images/e9131cbbe3646390afd7dc21b8f16b6d/3ac2b39ad528f8c8c5dc77c59abb683d.jpeg",
    "tags": {
        "t1": "Food"
    }
},

    {
    "id": 9,
    "name": "Yoshinoya",
    "category": "Food",
    "discount_description": "Student special: Enjoy a 15% discount on any beef bowl or meal set when you present your student ID. This offer is valid for dine-in only.",
    "requirements": {
        "r1": "Offer valid for in-store purchases only; not applicable for takeout or delivery.",
        "r2": "You must present a valid student ID to receive the discount. This offer cannot be combined with other promotions."
    },
    "locations": "https://www.google.com/maps/search/Yoshinoya+Osaka",
    "description": "Yoshinoya is a well-known fast-food chain specializing in gyudon (beef bowl) and other rice dishes. It is a popular choice among students for its affordability and quick service.",
    "expiration_date": "No expiration date, available on weekdays.",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/14/ee/2a/3d/yoshinoya-dotombori.jpg",
    "tags": {
        "t1": "Food",
    
    }
},

{
    "id": 10,
    "name": "Ichiran Ramen",
    "category": "Food",
    "discount_description": "Student special: Get a 10% discount on any ramen bowl when you present your student ID. Valid for dine-in only.",
    "requirements": {
        "r1": "This offer is applicable for in-person dining only and cannot be used for takeout or delivery.",
        "r2": "A valid student ID must be shown at the time of ordering. This discount cannot be combined with any other promotions."
    },
    "locations": "https://www.google.com/maps/search/Ichiran+Ramen+Osaka",
    "description": "Ichiran Ramen is renowned for its tonkotsu (pork bone) ramen and unique dining experience. The restaurant focuses on a solo dining concept, allowing customers to enjoy their meal in privacy, making it a favorite among ramen enthusiasts.",
    "expiration_date": "Valid until December 31, 2024, on weekdays only.",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjQeMYsr1ouSPypWpvG5RM6wGwTyo8f7sGH-fjZNeeTXURMnRSseOonqokY0P-w3Um7wHFWw-Qz-bKMjKMs8GxaDY1xARV_mBoXuw0l_NSdspSoYff_T6S0IEEu8awMSvr6QBuRMYATMG0F/s1600/DSCF0286.jpg",
    "tags": {
        "t1": "Food"
    }
}



]
